cylinderCases/nonNewtonianLaminar/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  powerLaw;

powerLawCoeffs
{
	//nuMax	0.5;
	//nuMin	0.000001;
	//k	0.008838835;
	//n	0.5;

	nuMax   0.5;
        nuMin   0.000001;
        k       1.07e-04;
        n       0.6976;
}


// ************************************************************************* //
